app/Controllers/NewsAdmin.php

SELECT *
FROM `news`
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `news`
---
    public function index()
    {

        $news = new NewsModel();

        // $data['newses'] = $news->paginate(1);
        // $data['pager'] = $news->pager;

        $data = [
            'newses' => $news->paginate(1, 'newses'),
            'pager' => $news->pager
        ];

SELECT *
FROM `news`
WHERE `id` = '1'
 LIMIT 1
---
    public function preview($id)
    {

        $news = new NewsModel();
        $data['news'] = $news->where('id', $id)->first();

SELECT *
FROM `news`
WHERE `id` = '1'
 LIMIT 1
---
    public function edit($id)
    {
        //ambil artikel
        $news = new NewsModel();
        $data['news'] = $news->where('id', $id)->first();

SELECT *
FROM `contactus`
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `contactus`
---
    public function view_contactus()
    {

        $contact = new ContactusModel();
        $data = [
            'newses' => $contact->paginate(1, 'newses'),
            'pager' => $contact->pager
        ];

SELECT *
FROM `liveupdate`
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `liveupdate`
---
    public function view_liveupdate()
    {

        $live = new LiveUpdateModel();
        $data = [
            'live' => $live->paginate(1, 'newses'),
            'pager' => $live->pager
        ];